// 1.Опп ин объктно ориентирование приложение мебошад ки барои кодамонро безопастьностно
// будан ва коди худро тоза навиштан хизмат мекунад ва дар худ кисмхои алохидаи дигаре дорад ба мисли
// ки бо объект ва клссхои он кор мекунад .
// 1.Инкапсулятсия
// 2.Инхерит
// 3.Полиморфизм
// 4.Абстрактион



// 2.Класс ин Чертёжи проектамон мебошад ва объект бошад экземпиляри класс яъне хонаи сохташуда
// ва фарк байни инхо дар он  аст ки класс чертёжамон мебошад ки дар класс мо сифатхои чертёжамон бо хамроии дейсвияашон менависем ва  дар объект бошад мо онхоро пур мекунем ё объекти навамон например студенти навамонро месозем



// 3.Филд ин сахрое мебошад ки дар дохили класс навишта мешаванд ва дар он чо мо метавонем айди ному насаб синну сол ва гайраро дохил кунем.
// Проперти бошад ин {get and set} мебошанд ки сахрои мо доступ додан ягон амалро ичро кардан ва гирифтанашон яъне хонданашонро ичро мекунад.




// 4.Конструктор чизе мебошад ки ба private мо ба воситаи public ва тагийрёбандаи дигареро дар он мегирем ба private field баробарашон мекунем.Яъне ба private доступ пайдо мекунем ва маълумоти моро хеч кас берун иваз карда натавонад.




// 5.Инкапсулятсия ин проекти моро безопасный мекунад например дар банк мо маблаг дорем  ва онро напрмер минуса нишон надихад яъне ба он мо шартхоямонро мегузорем
// ва ба воситаи як методе например ва дар даруни хамин метод мо тагйирёбандаамонро например amount-ро гирифта шарт медихем ки агар калони 0 бошад яъне сумаи мегузоштаамон калони 0 бошад он гох balance-амонро += AmbiguousImplementationException кунад.
// Яъне ба поляамонро привайт гирифта ба воситаи методаамон кор мекунем.


// 6.Модификаторхо инхо хамон public, private, protected va inherit мебошад
// яъне хамон поляамонро ба шахсони бегона доступ додан мемонем ё не например ба воситаи public va private
// ва ба воситаи protected мо ба насллхои ояндаамон мерос мегузорем ба мисли cat ki ba animals мерос мегузорад.Яъне публично ё закритно будани онро нигох медорад.

// using Exam2_C_;
// Exam2_C_.Math math = new Exam2_C_.Math();
// Console.WriteLine(math.Abs(100.0));
// Console.WriteLine(math.Abs(10.0));
// Console.WriteLine(math.Abs(10));
// Console.WriteLine(math.Pow(2, 2));
// Console.WriteLine(math.Sqrt(9));
// Console.WriteLine(math.Min(1, 5));
// Console.WriteLine(math.Max(5, 1));


using Exam2_C_;
Exam2_C_.Posts posts = new Exam2_C_.Posts()
{
    Title = "Super",
    Description = "Car",
    LikeCount = 5,
    Comments = {"Super", "Car", "{5}"},
};

Exam2_C_.Posts postss = new Exam2_C_.Posts()
{
    Title = "Super",
    Description = "Car",
    LikeCount = 5,
    Comments = {"Super", "Car", "{5}"},
};

Exam2_C_.Posts postsss = new Exam2_C_.Posts()
{
    Title = "Super",
    Description = "Car",
    LikeCount = 5,
    Comments = {"Super", "Car", "{5}"},
};

Exam2_C_.Posts postssss = new Exam2_C_.Posts()
{
    Title = "Super",
    Description = "Car",
    LikeCount = 5,
    Comments = {"Super", "Car", "{5}"},
};

Exam2_C_.Posts postsssss = new Exam2_C_.Posts()
{
    Title = "Super",
    Description = "Car",
    LikeCount = 5,
    Comments = {"Super", "Car", "{5}"},
};


